#include<stdio.h>
#include"menu.h"

void mainMenu()   //主菜单函数
{
	printf("\n\n\n\n");
	printf("                                  ******************模拟校园卡系统******************\n");
	printf("                                  *--------------------主菜单----------------------*\n");
	printf("                                  *                 1.管理员登录                   *\n");
	printf("                                  *                 2.学生登录                     *\n");
	printf("                                  *                 0.退出系统                     *\n");
	printf("                                  *------------------------------------------------*\n");
	printf("                                  **************************************************\n");
}

void adminMenu()  //二级菜单:管理员登录菜单函数
{
	printf("\n\n\n\n");
	printf("                                  **************************************************\n");
	printf("                                  *--------------------管理员菜单------------------*\n");
	printf("                                  *                 1.学生信息管理                 *\n");
	printf("                                  *                 2.收入情况                     *\n");
	printf("                                  *                 0.返回                         *\n");
	printf("                                  *------------------------------------------------*\n");
	printf("                                  **************************************************\n");
}

void stuMenu()  //二级菜单:学生登录菜单函数
{
	printf("\n\n\n\n");
	printf("                                  **************************************************\n");
	printf("                                  *-------------------学生菜单---------------------*\n");
	printf("                                  *                 1.查询信息                     *\n");
	printf("                                  *                 2.充值                         *\n");
	printf("                                  *                 3.修改密码                     *\n");
	printf("                                  *                 4.校园卡挂失                   *\n");
	printf("                                  *                 5.校园卡解挂                   *\n");
	printf("                                  *                 6.上机                         *\n");
	printf("                                  *                 0.返回                         *\n");
	printf("                                  *------------------------------------------------*\n");
	printf("                                  **************************************************\n");
}

void stuInformMenu()  //三级菜单:学生信息管理菜单函数
{
	printf("\n\n\n\n");
	printf("                                  **************************************************\n");
	printf("                                  *---------------------管理员---------------------*\n");
	printf("                                  *            1.查询学生校园卡信息                *\n");
	printf("                                  *            2.增加学生校园卡信息                *\n");
	printf("                                  *            3.删除学生校园卡信息                *\n");
	printf("                                  *            4.修改学生校园卡信息                *\n");
	printf("                                  *            0.返回                              *\n");
	printf("                                  *------------------------------------------------*\n");
	printf("                                  **************************************************\n");
}

void totalFee()       //三级菜单：收入情况菜单函数
{
	printf("\n\n\n\n");
	printf("                                 **************************************************\n");
	printf("                                 *---------------------管理员---------------------*\n");
	printf("                                 *            1.日收入情况                        *\n");
	printf("                                 *            2.月收入情况                        *\n");
	printf("                                 *            3.年收入情况                        *\n");
	printf("                                 *            0.返回                              *\n");
	printf("                                  *------------------------------------------------*\n");
	printf("                                 **************************************************\n");
}

void changeCardMenu()  //四级菜单:修改学生校园卡信息菜单函数
{
	printf("\n\n\n\n");
	printf("                                 **************************************************\n");
	printf("                                 *---------------------管理员---------------------*\n");
	printf("                                 *            1.修改ID                            *\n");
	printf("                                 *            2.修改姓名                          *\n");
	printf("                                 *            3.充值                              *\n");
	printf("                                 *            4.修改卡状态                        *\n");
	printf("                                 *            0.返回                              *\n");
	printf("                                 *------------------------------------------------*\n");
	printf("                                 **************************************************\n");
}

void admSearMenu()    //四级菜单:管理员查询校园卡信息菜单函数
{
	printf("\n\n\n\n");
	printf("                                 **************************************************\n");
	printf("                                 *----------------------管理员--------------------*\n");
	printf("                                 *                 1.学生个人基本信息             *\n");
	printf("                                 *                 2.全体学生基本信息             *\n");
	printf("                                 *                 0.返回                         *\n");
	printf("                                 *------------------------------------------------*\n");
	printf("                                 **************************************************\n");
}